HELYXcore-4.4.0/examples/legacy/multiphase/interFoam/laminar/vofToLagrangian/lagrangianDistributionInjection/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0.234;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
