HELYXcore-4.4.0/examples/legacy/multiphase/interFoam/laminar/vofToLagrangian/lagrangianDistributionInjection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 3;

vertices
(
    (-1  0 -1)
    (-1  0  1)
    ( 1  0  1)
    ( 1  0 -1)
    (-1  1 -1)
    (-1  1  1)
    ( 1  1  1)
    ( 1  1 -1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall walls
    (
        (2 6 5 1)
        (0 4 7 3)
        (0 1 5 4)
        (4 5 6 7)
        (7 6 2 3)
        (3 2 1 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
